## Terraform Summary

| Step                         | Result  |
|:-----------------------------|:-------:|
| 🖌  Terraform Format & Style | ✅ |
| ⚙️  Terraform Initialization  | ✅ |
| 🤖  Terraform Validation     | ✅ |
| 📖  Terraform Plan           | ✅ |

_**Hint:** If "Terraform Format & Style" failed, run `terraform fmt -recursive` from the `terraform/` directory and commit the results._

### Output

<details>
<summary>Validation Output</summary>

```
Success! The configuration is valid.


```

</details>

<details>
<summary>Plan Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
  ~ update in-place
-   destroy
-/+ destroy and then create replacement
+/- create replacement and then destroy

Terraform will perform the following actions:

  # aws_ecs_service.console will be updated in-place
  ~ resource "aws_ecs_service" "console" {
        id                                 = "arn:aws:ecs:us-west-2:357150818708:service/cpfreporter/cpfreporter-console"
        name                               = "cpfreporter-console"
        tags                               = {}
      ~ task_definition                    = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:125" -> (known after apply)
        # (15 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # aws_ecs_task_definition.console must be replaced
+/- resource "aws_ecs_task_definition" "console" {
      ~ arn                      = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console:125" -> (known after apply)
      ~ arn_without_revision     = "arn:aws:ecs:us-west-2:357150818708:task-definition/cpfreporter-console" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [
              ~ {
                  ~ image                  = "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:f2de64d95e511e955e8326a1568568449533fd6c958423f587dbbc67eec64b4c" -> "ghcr.io/usdigitalresponse/cpf-reporter-console@sha256:0e9323fdd03ef937da8f44c8b455c20aec20848acaaea980b8a6ca4876fe07a5"
-                   mountPoints            = []
                    name                   = "console"
-                   portMappings           = []
-                   systemControls         = []
-                   volumesFrom            = []
                    # (7 unchanged attributes hidden)
                },
            ] # forces replacement
        )
      ~ id                       = "cpfreporter-console" -> (known after apply)
      ~ revision                 = 125 -> (known after apply)
-       tags                     = {} -> null
        # (10 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_s3_object.lambda_artifact-graphql will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-graphql" {
      ~ etag                   = "aa58d7f2c1123b3ad7048bce2dd4c377-6" -> "9aec4e89c018919741d557f4baa1d761"
        id                     = "graphql.9aec4e89c018919741d557f4baa1d761.zip"
        tags                   = {}
      ~ version_id             = "dw6owtVYq.mW9L5b5eXcAZNRaqGCmM6M" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-processValidationJson will be updated in-place
  ~ resource "aws_s3_object" "lambda_artifact-processValidationJson" {
      ~ etag                   = "ada4a30aba929324eb23ead6dd3883bf-5" -> "49f6291dc84bb27b95f10c7de8148425"
        id                     = "processValidationJson.49f6291dc84bb27b95f10c7de8148425.zip"
        tags                   = {}
      ~ version_id             = "6xzCOyZ5YQGXpcbTPi8ymSqOWLij8chr" -> (known after apply)
        # (12 unchanged attributes hidden)
    }

  # aws_s3_object.lambda_artifact-python must be replaced
-/+ resource "aws_s3_object" "lambda_artifact-python" {
+       acl                    = (known after apply)
      ~ arn                    = "arn:aws:s3:::cpfreporter-lambdaartifacts-357150818708-us-west-2/python.532c0dc7de870c2e8ea7fe297da5a5c2.zip" -> (known after apply)
      ~ bucket_key_enabled     = false -> (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
      ~ content_type           = "binary/octet-stream" -> (known after apply)
      ~ etag                   = "ca417933e134fe606c3af9dd0097d520-4" -> "2f8013504a742c49f111d168b20fe39f"
      ~ id                     = "python.532c0dc7de870c2e8ea7fe297da5a5c2.zip" -> (known after apply)
      ~ key                    = "python.532c0dc7de870c2e8ea7fe297da5a5c2.zip" -> "python.2f8013504a742c49f111d168b20fe39f.zip" # forces replacement
+       kms_key_id             = (known after apply)
-       metadata               = {} -> null
      ~ source_hash            = "532c0dc7de870c2e8ea7fe297da5a5c2" -> "2f8013504a742c49f111d168b20fe39f"
      ~ storage_class          = "STANDARD" -> (known after apply)
-       tags                   = {} -> null
      ~ version_id             = "ywk_yBLpTeY6z5LHSwC3KUXPBR094lxW" -> (known after apply)
        # (5 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["200.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "b01b54924cc2bee5421d10a98f06e76b" -> "d2be778e41c7709a91b1a4d93e2ff19f"
        id                     = "dist/200.html"
      ~ source_hash            = "b01b54924cc2bee5421d10a98f06e76b" -> "d2be778e41c7709a91b1a4d93e2ff19f"
        tags                   = {}
      ~ version_id             = "5Tuh9bR6jJKbr6CQ9qk7ey6wE2uFjaAv" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["build-manifest.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "3a744fba14b09eec0cb835157038fc32" -> "6db90bfb1a352bb86ee5fbfca83e1f18"
        id                     = "dist/build-manifest.json"
      ~ source_hash            = "3a744fba14b09eec0cb835157038fc32" -> "6db90bfb1a352bb86ee5fbfca83e1f18"
        tags                   = {}
      ~ version_id             = "ivynsNyPJJCvw.4juBYSD4GBHR_IZqyG" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["chunk-references.json"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "5fc53c8a0918009060dbb3cb1bb03195" -> "5cb73770b0e64e3281a1477ced1019ac"
        id                     = "dist/chunk-references.json"
      ~ source_hash            = "5fc53c8a0918009060dbb3cb1bb03195" -> "5cb73770b0e64e3281a1477ced1019ac"
        tags                   = {}
      ~ version_id             = "GBLY7NsyAFKLu9VGbvzIQxRk4rJPVPuL" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["index.html"] will be updated in-place
  ~ resource "aws_s3_object" "origin_dist_artifact" {
      ~ etag                   = "b01b54924cc2bee5421d10a98f06e76b" -> "d2be778e41c7709a91b1a4d93e2ff19f"
        id                     = "dist/index.html"
      ~ source_hash            = "b01b54924cc2bee5421d10a98f06e76b" -> "d2be778e41c7709a91b1a4d93e2ff19f"
        tags                   = {}
      ~ version_id             = "jfAD4tijc5RHfyT2j_aLunTSjAsxlKow" -> (known after apply)
        # (11 unchanged attributes hidden)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.39be2748.js"] will be destroyed
  # (because key ["static/js/app.39be2748.js"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.39be2748.js" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/javascript" -> null
-       etag                   = "c67eab7bcde37415a8b8a51ea7e962d6" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.39be2748.js" -> null
-       key                    = "dist/static/js/app.39be2748.js" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.39be2748.js" -> null
-       source_hash            = "c67eab7bcde37415a8b8a51ea7e962d6" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "Pg_3EACdUAygIaJpz4zfERKT1yRXA5zr" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.39be2748.js.LICENSE.txt"] will be destroyed
  # (because key ["static/js/app.39be2748.js.LICENSE.txt"] is not in for_each map)
-   resource "aws_s3_object" "origin_dist_artifact" {
-       arn                    = "arn:aws:s3:::cpfreporter-origin-357150818708-us-west-2/dist/static/js/app.39be2748.js.LICENSE.txt" -> null
-       bucket                 = "cpfreporter-origin-357150818708-us-west-2" -> null
-       bucket_key_enabled     = false -> null
-       content_type           = "text/plain" -> null
-       etag                   = "3b6b61b80017ed2a756a2cec1364fac3" -> null
-       force_destroy          = false -> null
-       id                     = "dist/static/js/app.39be2748.js.LICENSE.txt" -> null
-       key                    = "dist/static/js/app.39be2748.js.LICENSE.txt" -> null
-       metadata               = {} -> null
-       server_side_encryption = "AES256" -> null
-       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.39be2748.js.LICENSE.txt" -> null
-       source_hash            = "3b6b61b80017ed2a756a2cec1364fac3" -> null
-       storage_class          = "STANDARD" -> null
-       tags                   = {} -> null
-       tags_all               = {
-           "env"        = "staging"
-           "management" = "terraform"
-           "owner"      = "grants"
-           "repo"       = "cpf-reporter"
-           "service"    = "cpf-reporter"
-           "usage"      = "workload"
        } -> null
-       version_id             = "9pzYZcodZOpPPF2MrUbqU6ivVk5Yair5" -> null
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.7185f465.js"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/javascript"
+       etag                   = "1d8b72d5cbcee32765bd4cfb13768ddb"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.7185f465.js"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.7185f465.js"
+       source_hash            = "1d8b72d5cbcee32765bd4cfb13768ddb"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # aws_s3_object.origin_dist_artifact["static/js/app.7185f465.js.LICENSE.txt"] will be created
+   resource "aws_s3_object" "origin_dist_artifact" {
+       acl                    = (known after apply)
+       arn                    = (known after apply)
+       bucket                 = "cpfreporter-origin-357150818708-us-west-2"
+       bucket_key_enabled     = (known after apply)
+       checksum_crc32         = (known after apply)
+       checksum_crc32c        = (known after apply)
+       checksum_sha1          = (known after apply)
+       checksum_sha256        = (known after apply)
+       content_type           = "text/plain"
+       etag                   = "3b6b61b80017ed2a756a2cec1364fac3"
+       force_destroy          = false
+       id                     = (known after apply)
+       key                    = "dist/static/js/app.7185f465.js.LICENSE.txt"
+       kms_key_id             = (known after apply)
+       server_side_encryption = "AES256"
+       source                 = "/home/runner/work/cpf-reporter/cpf-reporter/web/dist/static/js/app.7185f465.js.LICENSE.txt"
+       source_hash            = "3b6b61b80017ed2a756a2cec1364fac3"
+       storage_class          = (known after apply)
+       tags_all               = {
+           "env"        = "staging"
+           "management" = "terraform"
+           "owner"      = "grants"
+           "repo"       = "cpf-reporter"
+           "service"    = "cpf-reporter"
+           "usage"      = "workload"
        }
+       version_id             = (known after apply)
    }

  # module.lambda_function-cpfValidation.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-cpfValidation"
      ~ last_modified                  = "2024-05-01T18:42:50.000+0000" -> (known after apply)
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:92" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-cpfValidation:92/invocations" -> (known after apply)
      ~ s3_key                         = "python.532c0dc7de870c2e8ea7fe297da5a5c2.zip" -> "python.2f8013504a742c49f111d168b20fe39f.zip"
        tags                           = {}
      ~ version                        = "92" -> (known after apply)
        # (19 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                = "64a2f0c320ede17d251a4a8a7a44d0f4c6a69aa7" -> "2b6fc2f309bb5efd954c3db1df02c20988b3ba3e"
              ~ "DD_TAGS"                      = "git.commit.sha:64a2f0c320ede17d251a4a8a7a44d0f4c6a69aa7,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:2b6fc2f309bb5efd954c3db1df02c20988b3ba3e,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                   = "64a2f0c320ede17d251a4a8a7a44d0f4c6a69aa7" -> "2b6fc2f309bb5efd954c3db1df02c20988b3ba3e"
                # (14 unchanged elements hidden)
            }
        }

        # (4 unchanged blocks hidden)
    }

  # module.lambda_function-cpfValidation.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "92" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-graphql.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-graphql"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:140" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-graphql:140/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "140" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "64a2f0c320ede17d251a4a8a7a44d0f4c6a69aa7" -> "2b6fc2f309bb5efd954c3db1df02c20988b3ba3e"
              ~ "DD_TAGS"                            = "git.commit.sha:64a2f0c320ede17d251a4a8a7a44d0f4c6a69aa7,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:2b6fc2f309bb5efd954c3db1df02c20988b3ba3e,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "64a2f0c320ede17d251a4a8a7a44d0f4c6a69aa7" -> "2b6fc2f309bb5efd954c3db1df02c20988b3ba3e"
                # (18 unchanged elements hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.lambda_function-graphql.aws_lambda_permission.current_version_triggers["APIGateway"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "APIGateway" -> (known after apply)
      ~ qualifier           = "140" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_function.this[0] will be updated in-place
  ~ resource "aws_lambda_function" "this" {
        id                             = "cpfreporter-processValidationJson"
      ~ qualified_arn                  = "arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:48" -> (known after apply)
      ~ qualified_invoke_arn           = "arn:aws:apigateway:us-west-2:lambda:path/2015-03-31/functions/arn:aws:lambda:us-west-2:357150818708:function:cpfreporter-processValidationJson:48/invocations" -> (known after apply)
        tags                           = {}
      ~ version                        = "48" -> (known after apply)
        # (21 unchanged attributes hidden)

      ~ environment {
          ~ variables = {
              ~ "DD_COMMIT_SHA"                      = "64a2f0c320ede17d251a4a8a7a44d0f4c6a69aa7" -> "2b6fc2f309bb5efd954c3db1df02c20988b3ba3e"
              ~ "DD_TAGS"                            = "git.commit.sha:64a2f0c320ede17d251a4a8a7a44d0f4c6a69aa7,git.repository_url:github.com/usdigitalresponse/cpf-reporter" -> "git.commit.sha:2b6fc2f309bb5efd954c3db1df02c20988b3ba3e,git.repository_url:github.com/usdigitalresponse/cpf-reporter"
              ~ "DD_VERSION"                         = "64a2f0c320ede17d251a4a8a7a44d0f4c6a69aa7" -> "2b6fc2f309bb5efd954c3db1df02c20988b3ba3e"
                # (16 unchanged elements hidden)
            }
        }

        # (5 unchanged blocks hidden)
    }

  # module.lambda_function-processValidationJson.aws_lambda_permission.current_version_triggers["S3BucketNotification"] must be replaced
-/+ resource "aws_lambda_permission" "current_version_triggers" {
      ~ id                  = "S3BucketNotification" -> (known after apply)
      ~ qualifier           = "48" # forces replacement -> (known after apply) # forces replacement
+       statement_id_prefix = (known after apply)
        # (5 unchanged attributes hidden)
    }

Plan: 7 to add, 10 to change, 7 to destroy.
```

</details>

*Pusher: @TylerHendrickson, Action: `pull_request_target`, Workflow: [`Continuous Integration`](https://github.com/usdigitalresponse/cpf-reporter/actions/runs/8915475767)*